Repository: youtonghy/Todex_mobile
Catalog: Packages/TodexCore/Sources/TodexCore/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko

source: 这是旧版未加密的历史，只能查看、导出、归档或删除
en: This is legacy unencrypted history. You can only view, export, archive, or delete it.
ja: これは暗号化されていない旧形式の履歴です。表示、書き出し、アーカイブ、削除のみ可能です。
ko: 암호화되지 않은 이전 형식의 기록입니다. 보기, 내보내기, 보관, 삭제만 할 수 있습니다.

source: 远程后端必须使用加密连接，请重新配对
en: A remote backend requires an encrypted connection. Pair again.
ja: リモートバックエンドには暗号化接続が必要です。再ペアリングしてください
ko: 원격 백엔드는 암호화 연결을 사용해야 합니다. 다시 페어링하세요

source: 连接中断，未收到操作确认
en: Connection lost before the action was confirmed
ja: 接続が切断され、操作の確認を受信できませんでした
ko: 연결이 끊겨 작업 확인을 받지 못했습니다

source: 连接失败
en: Connection failed
ja: 接続に失敗しました
ko: 연결 실패

source: 连接已中断
en: Connection interrupted
ja: 接続が中断されました
ko: 연결이 중단되었습니다

source: 连接已断开
en: Disconnected
ja: 切断されました
ko: 연결이 끊어졌습니다

source: 连接已断开，请重新连接后端
en: Disconnected. Reconnect to the backend.
ja: 接続が切断されました。バックエンドに再接続してください
ko: 연결이 끊어졌습니다. 백엔드에 다시 연결하세요

source: 连接请求计数已耗尽，请重新连接
en: Connection request counter exhausted. Reconnect.
ja: 接続リクエストのカウンターが上限に達しました。再接続してください
ko: 연결 요청 카운터가 소진되었습니다. 다시 연결하세요

source: 连接超时，请确认 Backend 已启动
en: Connection timed out. Make sure the backend is running.
ja: 接続がタイムアウトしました。バックエンドが起動していることを確認してください
ko: 연결 시간이 초과되었습니다. 백엔드가 실행 중인지 확인하세요

source: 配对内容过大
en: Pairing content is too large
ja: ペアリング内容が大きすぎます
ko: 페어링 내용이 너무 큽니다
